[
  "YAML has two types of settings: general options which can be changed using Bobbert's Mod Options, and Game Settings which are specific to a save game. These can be accessed from the pause menu.",
  "Flushing coolant (default key 9) immediately removes 20% of max heat at the cost of -10% heat dissipation for the rest of the mission.",
  "Disable \"collapse equipment slots\" in the mod options to enjoy full size gyro and cockpit slots.",
  "Mods like \"Yet Another Weapon\", \"Yet Another Weapon Clan\" or \"Yet Another Equipment Collection\" introduce many new weapons and equipments that will make you optimizing builds for hours in the Mechlab.",
  "In YAML the engine weight includes the standard gyro and cockpit tonnage, as well as the weight for 10 heat sinks.",
  "Engines with a rating below 250 have less than 10 integrated heat sinks. They require additional heat sinks to be installed to get to a minimum of 10.",
  "You can enable YAML's Thermal Vision on any 'Mech at any time.",
  "YAML comes with head lights on every 'Mech. Light up those dark nights.",
  "All weapons and equipment use Critical Slots. If you don't have enough free, you will not be able to install them.",
  "Non-Standard Engines require free slots in the side torsos.",
  "Armor, Structure and various other equipment use dynamically placed fillers to simulate their bulk.",
  "If you have enough free slots, you can install it.",
  "Weapons are no longer Small / Medium / Large with fixed slots. They take Crit slots just like any other equipment.",
  "All weapons with more than 7 crit slots can be split to a neighboring component.",
  "Crit splitting allows you to equip XL engine and Heavy Gauss Rifle.",
  "Thermal Vision will show the heat levels on 'Mechs.",
  "HarJel offers self-repair abilities for Mechs.",
  "UAV Drones will show all targets in their range on your map and radar.",
  "UAV Drones help with LRM locks and indirect fire.",
  "If you are prone to overheating, take a Cool Shot.",
  "Flushing coolant will permanently decrease the cooling efficiency of your 'Mech for the rest of the mission.",
  "You can set your mods' keybinds in Options / Controls for UAV, Headlights, Thermal Vision etc.",
  "Endosteel Structure offers much better weight saving compared to Ferro-Fibrous armor.",
  "Endo, Ferro and other advanced equipment are more expensive to repair than Standard versions.",
  "You can install JumpJets on any 'Mech if you enable the Unrestricted Jumpjets option in Mod Options.",
  "You can install ECM, Active Probe and MASC / SuperCharger on any 'Mech.",
  "You can stack MASC and SuperCharger for +100% speed bonus.",
  "Triple Strength Myomer increases both max speed and melee damage at high heat and can be used with SuperCharger.",
  "Pick up your free SLDF Wolverine II at Valentina now!",
  "You can save and load your favorite loadouts in the Mechlab.",
  "Oraeon's TTRulez_AI will use the Upgrades to specify AI Roles.",
  "Many 'Mechs have Quirks, making them more efficient with certain weapons, adding bonus armor and structure, or making them cheaper to repair or upkeep.",
  "You can fine-tune the economic difficulty such as install costs, upkeep costs, salvage in Game Settings.",
  "Make sure your cooling/s is at least half of your weapon heat/s.",
  "This is not MWO. Always have a few backup lasers, and armor on your back.",
  "Take at least 2 tons of ammo for each of your main weapons."
]